<a href="https://colab.research.google.com/github/sabsabb/Python-Pandas/blob/main/Pandas_03.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Konversi tipe data String ke Numerik pada kolom Data Frame**

Import Library

In [6]:
import pandas as pd

Persiapan Data Frame

In [3]:
#Data dibentuk dari dict
data = {'col1':['1','2','3','teks'],
        'col2':['1','2','3','4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [4]:
df.dtypes

col1    object
col2    object
dtype: object

Konversi Tipe Data dengan fungsi astype()

Cara 1 :

In [5]:
df_2 = df.astype({'col2':'int'})
df_2

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [7]:
df_2.dtypes

col1    object
col2     int64
dtype: object

Cara 2 :

In [8]:
df['col2'] = df['col2'].astype(float)
df.dtypes

col1     object
col2    float64
dtype: object

In [9]:
df

   col1  col2
0     1   1.0
1     2   2.0
2     3   3.0
3  teks   4.0

Konversi Tipe Data Numerik dengan fungsi to_numeric()

In [11]:
df.apply(pd.to_numeric, errors='coerce')

#fungsi 'coerce' adalah untuk menghandle jika terdapat data yang tidak bisa diubah ke numerik dan akan digantikan dengan nilai NaN

   col1  col2
0   1.0   1.0
1   2.0   2.0
2   3.0   3.0
3   NaN   4.0